processor/src/web/web/WEB-INF/classes/META-INF/rnip/addcategory.xml

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><S:Header><wsse:Security S:actor="http://smev.gosuslugi.ru/actors/smev" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="SenderCertificate"></wsse:BinarySecurityToken></wsse:Security></S:Header><S:Body wsu:Id="body"><!-- Здесь идёт тело запроса--><n1:UnifoTransferMsg xsi:schemaLocation="http://roskazna.ru/SmevUnifoService/ UnifoTransferMsg.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:n1="http://roskazna.ru/SmevUnifoService/" xmlns:n5="http://www.altova.com/samplexml/other-namespace" xmlns:ns1="http://www.bssys.com/xsd/Catalog" xmlns:pirq="http://roskazna.ru/xsd/PGU_ImportRequest" xmlns:smev="http://smev.gosuslugi.ru/rev111111" xmlns:smev2="http://roskazna.ru/SmevUnifoService/" xmlns:unifo="http://rosrazna.ru/xsd/SmevUnifoService" xmlns:org="http://roskazna.ru/xsd/Organization" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><smev:Message><smev:Sender><smev:Code>00402</smev:Code><smev:Name>ГУП Перовский школьник</smev:Name></smev:Sender><smev:Recipient><smev:Code>9500</smev:Code><smev:Name>RNIP</smev:Name></smev:Recipient><smev:Originator><smev:Code/><smev:Name>String</smev:Name></smev:Originator><smev:TypeCode>GSRV</smev:TypeCode><smev:Status>REQUEST</smev:Status><smev:Date>2012-12-27T17:36:47.0Z</smev:Date><smev:ExchangeType>String</smev:ExchangeType><smev:RequestIdRef>String</smev:RequestIdRef><smev:OriginRequestIdRef>String</smev:OriginRequestIdRef><smev:ServiceCode>String</smev:ServiceCode><smev:CaseNumber>String</smev:CaseNumber><smev:TestMsg>String</smev:TestMsg></smev:Message><smev:MessageData><smev:AppData><unifo:ImportData><pirs:ImportRequest xmlns:n2="http://www.altova.com/samplexml/other-namespace" xmlns:pirs="http://roskazna.ru/xsd/PGU_ImportRequest"><PostBlock><ID>String</ID><TimeStamp>2012-12-27T17:36:47.0Z</TimeStamp><SenderIdentifier>00402</SenderIdentifier></PostBlock><Catalog><ServiceCatalog name="Каталог ИС ПП" revisionDate="2012-12-25" version="1.0"><ns1:Service code="AAAAA004020000000001" desc="Оплата питания школьника" isActive="true" name="Питание для школьников"><ns1:ServiceCategory code="000071" name="Питание для школьников"/><ns1:PaymentParameters><ns1:DescriptionSimpleParameter label="Номер договора" isId="1" name="NUM_DOGOVOR" required="true" visible="true" readonly="false" forSearch="true" forPayment="true"><ns1:Regexp>^\d{6,8}$</ns1:Regexp></ns1:DescriptionSimpleParameter><ns1:DescriptionSimpleParameter label="КБК" name="KBK" required="true" visible="false" readonly="true" forPayment="true"><ns1:DefaultValue>12407024351203611340</ns1:DefaultValue></ns1:DescriptionSimpleParameter></ns1:PaymentParameters><ns1:CurrenciesServices><ns1:CurrencyCode>RUR</ns1:CurrencyCode></ns1:CurrenciesServices><org:Payee INN="7720003223" KPP="772001001" OGRN="1027739593420" name="ГУП «Перовский школьник»"><Accounts><Account kind="1"><Account>40602810938120000007</Account><Bank><Name>ОАО Сбербанка России г. Москва</Name><CorrespondentBankAccount>30301810800006003800</CorrespondentBankAccount><BIK>044525225</BIK></Bank></Account></Accounts></org:Payee><ns1:PaymentKind>3</ns1:PaymentKind><ns1:MinAmount currency="RUR" exponent="2">1</ns1:MinAmount><ns1:MaxAmount currency="RUR" exponent="2">2147483647</ns1:MaxAmount><ns1:Commissions><Comission><Kind>1</Kind><Percent>0.0</Percent><MinValue currency="RUR" exponent="2">1</MinValue><MaxValue currency="RUR" exponent="2">2147483647</MaxValue></Comission></ns1:Commissions></ns1:Service></ServiceCatalog></Catalog></pirs:ImportRequest></unifo:ImportData></smev:AppData></smev:MessageData></n1:UnifoTransferMsg><!-- --></S:Body></S:Envelope>